#include "Map_Path_Data.h"

// 当前生效地图对象数量
size_t Obstacles_count = 0; // 当前障碍物数量
size_t Boxes_count = 0;     // 当前箱子数量
size_t Targets_count = 0;   // 当前目标点数量
size_t Bombs_count = 0;     // 当前炸弹数量
size_t Car_path_count = 0;  // 当前路径点数量

// 当前生效地图对象位置
Position obstacles[MAX_OBSTACLES] = {{0}}; // 当前障碍物坐标列表
Position boxes[MAX_BOXES] = {{0}};         // 当前箱子坐标列表
Position targets[MAX_TARGETS] = {{0}};     // 当前目标点坐标列表
Position bombs[MAX_BOMBS] = {{0}};         // 当前炸弹坐标列表
Position car = {1, 1};                     // 车辆整数栅格位置
Position car_path[MAX_CAR_PATH] = {{0}};   // 预留路径坐标列表
CarPose car_position = {1, 1, 0, 1.00, 1.00, 0.00};   // 车辆浮点栅格位置

// 在此直接输入地图
const char *map_text1 =".#............\n"
                       "........#####.\n"
                       "#B###...#T..#.\n"
                       "....#...#T#.#.\n"
                       "....#####T#.#.\n"
                       "C......B..B.#.\n"
                       "..........###.\n"
                       "..............\n"
                       ".....####.....\n"
                       "..............\n";
const char *map_text2 ="..#.#........T\n"
                       "....#......#..\n"
                       ".B..#B........\n"
                       ".........#...#\n"
                       "..#....#......\n"
                       "C..#..#T..#...\n"
                       "............B.\n"
                       "####.##..##...\n"
                       "..............\n"
                       "T.......#.....\n";
const char *map_text3 =".#...#..#....T\n"
                       "...#..#.####..\n"
                       "#.###.#.#.....\n"
                       ".T#.#.#.#..#..\n"
                       ".##.#.........\n"
                       "..#.......##..\n"
                       "CD.......D.#..\n"
                       "..B.#.....BD..\n"
                       ".B..########..\n"
                       "....#T........\n";
const char *map_text4 ="......#....#T#\n"
                       "...........#.#\n"
                       ".....#.#...#.#\n"
                       ".#.#..B....#..\n"
                       ".#.#.#.#......\n"
                       "C#.#..B..#.#..\n"
                       ".....#.#.#.#..\n"
                       ".#.##.B..#.##.\n"
                       ".....#.#......\n"
                       "....T.......T.\n";
const char *map_text5 =".#.T....#.....\n"
                       "........#..T..\n"
                       "......D.#.....\n"
                       "........#..B..\n"
                       "C...#####.....\n"
                       "..B.#.........\n"
                       "....#....B....\n"
                       "....#.........\n"
                       "....#.......T.\n"
                       "....#.........\n";
